#+TITLE: Shell 编程
#+DATE: <2022-01-16 14:13:12>
#+TAGS[]: shell
#+CATEGORIES[]: shell
#+LANGUAGE: zh-cn
#+STARTUP: indent

#+begin_quote
[[https://www.gnu.org/savannah-checkouts/gnu/bash/manual/bash.html][Bash Reference Manual]]

[[https://riptutorial.com/bash/example/7580/replace-pattern-in-string][Bash - Replace pattern in string | bash Tutorial]]
#+end_quote

** 命令替换

=``= 反引号字符使用(~$()~)相当于把内容当做命令来执行，如：

#+begin_src sh
today=$(date +%Y-%m-%d)
echo $today
echo `date +%Y-%m-%d`
#+end_src

#+RESULTS:
| 2022-01-16 |
| 2022-01-16 |

用于数学运算：
#+begin_src sh
sum=$(expr 1 + 2)
echo "sum="$sum
#+end_src

#+RESULTS:
: sum=3

** 算术运算符

~++, --, !, **, <<, >>, &, |, &&, ||~~

#+begin_src sh :results output
i=2
echo "i=$i, i++=$((i++)), ++i=$((++i))"
echo "i=$i, i--=$((i--)), --i=$((--i))"
echo "i=$i, !i=$((!i)), ~i=$((~i))"
echo "i=$i, i**2=$((i**2))"
echo "i=$i, i<<2=$((i<<2)), i>>2=$((i>>2))"
echo "i=$i, i&0=$((i&0)), i&3=$((i&3))"
echo "i=$i, i&&0=$((i&&0)), i||0=$((i||0))"
#+end_src

#+RESULTS:
: i=2, i++=2, ++i=4
: i=4, i--=4, --i=2
: i=2, !i=0, ~i=-3
: i=2, i**2=4
: i=2, i<<2=8, i>>2=0
: i=2, i&0=0, i&3=2
: i=2, i&&0=0, i||0=1

** 逻辑运算符

1. 数值比较

   - =-eq=: 相等, equal
   - =-ge=: 大于或等于, great or equal
   - =-gt=: 大于, great then
   - =-le=: 小于或等于, less or equal
   - =-lt=: 小于, less then
   - =-ne=: 不等于， not equal

2. 字符串比较(~=, !=, <, >, <=, >=, -n, -z~)

   =-n string= 判断字符串长度是不是不为零

   =-z string= 判断字符串长度是不是为零

3. 文件判断(常用： ~-d, -e, -f, -x, -h~)

   | 符号             | 描述                                     |
   |------------------+------------------------------------------|
   | =-d file=          | 文件是否存在                             |
   | =-e file=          | 文件或目录是否存在                       |
   | =-f file=          | 是不是一个文件                           |
   | =-r file=          | 文件是否可读                             |
   | =-s file=          | 是否存在并非空                           |
   | =-w file=          | 是否存在且可写                           |
   | =-x file=          | 是否存在并可执行                         |
   | =-h file=          | 文件是不是一个符号链接                   |
   | =-O file=          | 检查 file 是否存在并属当前用户所有         |
   | =-G file=          | 检查 file 是否存在并且默认组与当前用户相同 |
   | =file1 -nt file2=  | 检查 file1 是否比 file2 新, new then         |
   | =file1 -ot file2== | 检查 file1 是否比 file2 旧, old then         |


复合条件判断(~if [ cond1 ] && [ cond2 ]; then ... fi~)

#+begin_src sh :results output
if [ $USER == gcl ] && [ -z $HOST ] ; then
    echo "user: $USER, no host 1"
fi

# 双括号可直接使用 &&, || 复合条件
if [[ $USER == gcl && -z $HOST ]]; then
    echo "user: $USER, no host 2"
fi

if [ -d $HOME/.gclrc ]; then
    echo "my dotfiles is a directory..."
fi

if [ -f $HOME/.gclrc/.zshrc ] && [ -h $HOME/.zshrc ]; then
    echo ".zshrc is a file and it is a symbol link to \n$(ls -al $HOME/.zshrc)..."
fi

if [ -x $HOME/.gclrc/bin/install-refresh-os ]; then
    echo "install-refresh-os is a shell file to install everything when re-setup a refresh MacOS..."
fi

#+end_src

#+RESULTS:
: user: gcl, no host 1
: user: gcl, no host 2
: my dotfiles is a directory...
: .zshrc is a file and it is a symbol link to
: lrwxr-xr-x  1 gcl  staff  24 Jan  4 14:22 /Users/gcl/.zshrc -> /Users/gcl/.gclrc/.zshrc...
: install-refresh-os is a shell file to install everything when re-setup a refresh MacOS...


** 各种括号使用

1. =[]=
2. =[[]]= 用于比较字符串，提供了 *test* 没有的模式匹配等特性
   #+begin_src sh :results output
echo  "> check user name start with 'r' ?"
if [[ $USER == r* ]]; then
    echo "yes"
else
    echo "no"
fi
   #+end_src

   #+RESULTS:
   : > check user name start with 'r' ?
   : no

3. =()=
4. =(())= 用于数学表达式或高级字符串处理
   #+begin_src sh :results output
val=10
if (( $val ** 2 > 90 )); then
    echo "$val ** 2 > 90"
fi
   #+end_src

   #+RESULTS:
   : 10 ** 2 > 90

*** if...elif...else

基本语法：

~if command; then expressions fi~

或使用 =test=

~if test condition; then ... fi~

便捷方式：

~if [ condition ]; then ... fi~

#+begin_src sh :results output
if test $(which ls); then
    echo "1 has ls"
fi

if [ -n $(which ls) ]; then
    echo "2 has ls"
else
    echo "2 has not ls"

fi
#+end_src

#+RESULTS:
: 1 has ls
: 2 has ls

*** for

shell 中默认会将空格当做分割符, 可以通过修改 =IFS= 变量来改变这个默认值(**用完记得还原回去**)。

#+begin_src sh :results output
list="a b c"
for var in $list
do
    echo "char: $var"
done
#+end_src

#+RESULTS:
: char: a
: char: b
: char: c

修改 =IFS=

#+begin_src sh :results output
file="/tmp/test"
echo "
line 1;line 1.1
line 2:line 2.1
line 3" >$file

echo "修改 IFS 之前:"
for line in $(cat $file)
do
    echo $line
done
OLDIFS=$IFS
IFS=$'\n'
echo "修改 IFS 之后"
for line in $(cat $file)
do
    echo $line
done

IFS=';:'
echo "修改 IFS 之后"
for line in $(cat $file)
do
    echo $line
done

#+end_src

#+RESULTS:
#+begin_example
修改 IFS 之前:
line
1;line
1.1
line
2:line
2.1
line
3
修改 IFS 之后
line 1;line 1.1
line 2:line 2.1
line 3
修改 IFS 之后

line 1
line 1.1
line 2
line 2.1
line 3
#+end_example

#+begin_quote
*注意* ： $'\n' 如果是转义字符要用 =$= 做前缀，否则会被当前 =n= 字符处理。
#+end_quote

C 语言风格：

#+begin_src sh :results output
for (( i=1; i<=5; i++ ))
do
    echo "num: $i"
done
#+end_src

#+RESULTS:
: num: 1
: num: 2
: num: 3
: num: 4
: num: 5
*** while

#+begin_src sh
while test command
do
 other commands
done
#+end_src

test command 和 if 中的一模一样，支持 if 条件的相同语法。

#+begin_src sh
while [ $var1 -gt 0 ]
do
 echo $var1
 var1=$[ $var1 - 1 ]
done
#+end_src

条件中可以用多条命令：

#+begin_src sh :results output
n=5
while echo $n
 [ $n -ge 0 ]
do
 echo "This is inside the loop"
 n=$[ $n - 1 ] # 这里也可以用 n=$((n-1))
done
#+end_src

#+RESULTS:
#+begin_example
5
This is inside the loop
4
This is inside the loop
3
This is inside the loop
2
This is inside the loop
1
This is inside the loop
0
This is inside the loop
-1
#+end_example
*** until

和 while 相反，一直执行循环体直到命令返回的状态码非零结束。

#+begin_src sh
until test commands
do
     other commands
done
#+end_src

until 条件中也可以放多个命令

#+begin_src sh :results output
var1=100
until [ $var1 -eq 0 ]
do
     echo $var1
     var1=$[ $var1 - 25 ]
done
#+end_src

#+RESULTS:
: 100
: 75
: 50
: 25
** read

获取用户输入。

1. ~read [varname]~ 会从用户输入获取内容，然后赋值给遍历 varname

2. ~read -p <tip> [varname]~ 允许指定提示符可以不指定变量，那么会将输入的内容存放
   到 ~$REPLY~ 变量中。

3. ~read -t <seconds> [varname]~ 指定等待的描述，不然会一直阻塞在等待用户输入，当
   超时时 read 会返回一个非零的退出码

4. ~read -n1 -p "Do you want to continue [Y/N]? " answer~

   ~-n1~ 指定用户输入多少个字符就结束。

   #+begin_src sh
read -n1 -p "Do you want to continue [Y/N]? " answer
case $answer in
 Y | y) echo
  echo "fine, continue on…";;
 N | n) echo
  echo OK, goodbye
  exit;;
esac
echo "This is the end of the script"
   #+end_src

5. 隐藏输入内容，比如输入密码(=-s=)

   #+begin_src sh
read -s -p "Enter your password: " pass
   #+end_src


测试：~read~ 读取文件时，每次回读取一行，直到结束，结合 ~cat~ 和管道可以在脚本中从一
个文件读取内容

#+begin_src sh :results output
count=1
cat /tmp/test | while read line
do
     echo "[$count]: $line"
     count=$[ $count + 1]
 done
echo "Finished processing the file"
#+end_src

#+RESULTS:
: [1]:
: [2]: line 1;line 1.1
: [3]: line 2:line 2.1
: [4]: line 3
: Finished processing the file
